### Terraform Infrastructure auto-generated comment
#### Terraform Format and Style 🖌`failure`
#### Terraform Linting 🔧`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
tls_private_key.generated: Refreshing state... [id=9396f37c6def18c462fb1361b97a95fc82253ff2]
local_file.private_key_pem: Refreshing state... [id=fc0345d29f052b7546e7e0842fa847514d871e6c]
data.aws_availability_zones.az: Reading...
data.aws_ami.ubuntu_22_04: Reading...
aws_key_pair.generated: Refreshing state... [id=AWSKEY]
aws_vpc.vpc: Refreshing state... [id=vpc-0c9e3e793e35fbcfc]
data.aws_availability_zones.az: Read complete after 1s [id=ap-southeast-1]
data.aws_ami.ubuntu_22_04: Read complete after 1s [id=ami-0fa377108253bf620]
aws_internet_gateway.igw: Refreshing state... [id=igw-01f9ab2aaf85740ac]
aws_security_group.vpc-ping: Refreshing state... [id=sg-0d1d1c70acd13966d]
aws_subnet.public_subnets[0]: Refreshing state... [id=subnet-0fc6ada59460afc45]
aws_security_group.ingress-ssh: Refreshing state... [id=sg-0ea63b32db0a52b36]
aws_security_group.vpc-web: Refreshing state... [id=sg-000d7dbb7bd37982a]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0cb79293a5e6b7c21]
aws_route_table_association.public_route_table_association[0]: Refreshing state... [id=rtbassoc-0518f19c855ea3551]
aws_instance.ubuntu_server: Refreshing state... [id=i-0ac4ddda0c56c54d5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.ubuntu_server must be replaced
-/+ resource "aws_instance" "ubuntu_server" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:099608707772:instance/i-0ac4ddda0c56c54d5" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0ac4ddda0c56c54d5" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-025ee0cc9a7d774bd" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-180.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.180" -> (known after apply)
      ~ public_dns                           = "ec2-54-255-177-4.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.255.177.4" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-000d7dbb7bd37982a",
          + "sg-0d1d1c70acd13966d",
          + "sg-0ea63b32db0a52b36",
        ]
      ~ tags                                 = {
          + "Env"  = "Dev"
            "Name" = "Ubuntu EC2 Server"
        }
      ~ tags_all                             = {
          + "Env"  = "Dev"
            # (1 unchanged element hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-000d7dbb7bd37982a",
          - "sg-0d1d1c70acd13966d",
          - "sg-0ea63b32db0a52b36",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = true -> null
          - iops                  = 100 -> null
          - kms_key_id            = "arn:aws:kms:ap-southeast-1:099608707772:key/6e36ab34-feff-430b-90de-e8d2252abe8a" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-015cd8e3eae9802dd" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # local_file.private_key_pem will be created
  + resource "local_file" "private_key_pem" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "AWSKEY.pem"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @duyprog, Action: `pull_request`*